app/controllers/ledgers_controller.rb

	def edit
		courier = Ledger.where(:id=>params[:id])[0]
---
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 4

	def destroy
		ledger = Ledger.where(:id=>params[:id], :ledger_id=>current_user.id)[0]
		if ledger.present?
			ledger.destroy
---
SELECT `ledgers`.* FROM `ledgers` WHERE `ledgers`.`id` = 5 AND `ledgers`.`ledger_id` = 1
DELETE FROM `ledgers` WHERE `ledgers`.`type` IN ('Income') AND `ledgers`.`id` = 5